const TP_CARD = '<span style="color: #2980fe">TP कार्ड</span>';
export default {
  COMMON: {
    LAYOUT: {
      features: 'विशेषताएँ',
      products: 'उत्पादों',
      buyCryptoFooter: 'खरीदना',
      mobileWallet: 'मोबाइल वॉलेट',
      mobileWalletDesc: 'ब्लॉकचेन पर क्रिप्टो और DeFi मोबाइल वॉलेट।',
      hardwareWallet: 'एक्सटेंशन वॉलेट',
      hardwareWalletDesc: 'आपके कंप्यूटर पर एक बेहतर वॉलेट.',
      TPCard: 'TP कार्ड',
      TPCardDesc: 'एक बैंक कार्ड विकेंद्रीकृत तरीके से संचालित होता है।',
      extensionWallet: 'हार्डवेयर वॉलेट',
      extensionWalletDesc:
        'अपनी संपत्तियों की सुरक्षा के लिए अपना KeyPal प्राप्त करें।',
      desktop: 'Desktop Wallet',
      fiveDegrees: '5Degrees',
      versionVerification: 'संस्करण सत्यापन',
      versionVerificationDesc: 'अपना वॉलेट सत्यापित करें.',
      approvalDetector: 'अनुमोदन डिटेक्टर',
      approvalDetectorDesc: 'अपने स्वीकृत टोकन देखें और अस्वीकृत करें।',
      tokenSecurity: 'टोकन सुरक्षा',
      tokenSecurityDesc:
        'सत्यापित करें कि टोकन उसके अनुबंध पते से सुरक्षित है या नहीं।',
      keyGenerator: 'कुंजी जनरेटर',
      keyGeneratorDesc:
        'विभिन्न नेटवर्कों के लिए बेतरतीब ढंग से सार्वजनिक और निजी कुंजी उत्पन्न करें।',
      tokenProfile: 'टोकन प्रोफ़ाइल',
      tokenProfileDesc: 'टोकन के बारे में सारी जानकारी जानें.',
      tokenClaim: 'सांकेतिक दावा',
      tokenClaimDesc: 'अपने एयरड्रॉप का दावा करें.',
      easyInscription: 'आसान शिलालेख',
      easyInscriptionDesc: 'एक सुरक्षित शिलालेख उपकरण.',
      nostrAssetsBatchSender: 'NostrAssets  बैचसेंडर',
      nostrAssetsBatchSenderDesc: 'NostrAssets के लिए एक बैच भेजने वाला उपकरण।',
      BATCH_SENDER: 'बैचसेंडर',
      BATCH_SENDER_DESC: 'एक साथ अनेक प्राप्तकर्ताओं को टोकन भेजें।',

      trade: 'व्यापार',
      swap: 'बदलना',
      swapDesc: 'सर्वोत्तम कीमतों के साथ व्यापार करें।',
      bridge: 'ब्रिज',
      bridgeDesc:
        'परिसंपत्तियों को एक श्रृंखला से दूसरी श्रृंखला में निर्बाध रूप से स्थानांतरित करें।',
      buyCrypto: 'खरीदना',
      buyCryptoDesc: 'अपने क्रेडिट कार्ड से क्रिप्टोकरेंसी खरीदें।',
      market: 'बाज़ार',
      marketDesc: 'हॉट टोकन खोजने के लिए वास्तविक समय की अंतर्दृष्टि।',

      information: 'जानकारी',
      blockchainGuide: 'ब्लॉकचेन गाइड',
      tronWallet: 'ट्रॉन गाइड',
      iostWallet: 'IOST गाइड',
      tpMan: 'TP Man',

      developers: 'डेवलपर्स',
      github: 'Github (TP-Lab)',
      devCenter: 'डेवलपर केंद्र',
      developersDesc: 'टोकनपॉकेट डेवलपर दस्तावेज़ीकरण।',
      subToken: 'टोकन जमा करें',
      subTokenDesc: 'अपना टोकन जमा करें.',
      subDApp: 'DApp जमा करें',
      subDAppDesc: 'अपना DApp जमा करें, और ऑडिट के बाद इसे दिखाएं।',
      subNFT: 'NFT जमा करें',
      subNFTDesc: 'अपना NFT और कला जमा करें।',
      subChain: 'चेन जमा करें',
      subChainDesc: 'अपना ब्लॉकचेन सबमिट करें.',
      bugBounty: 'Bug Bounty',

      tools: 'औजार',

      build: 'निर्माण',

      learn: 'सीखना',

      explorer: 'अन्वेषक',
      darkMode: 'डार्क मोड',

      company: 'कंपनी',
      about: 'के बारे में',
      careers: 'करियर',
      pressKit: 'ब्रांड किट',
      swagShop: 'स्वैग की दुकान',

      support: 'सहायता',
      helpCenter: 'सहायता केंद्र',
      helpCenterDesc: 'उत्तर और सहायता के लिए आपके संसाधन।',
      contactUs: 'संपर्क करें',
      contactUsDesc: 'अपने सुझाव साझा करें और कोई भी प्रश्न पूछें।',
      forum: 'फोरम',
      forumDesc: 'समुदाय के सदस्यों के साथ अपनी बातचीत का आनंद लें।',

      legal: 'वैध',
      privacyPolicy: 'गोपनीयता नीति',
      terms: 'उपयोग की शर्तें',

      toHome: 'होम',
      defiWallet: 'DeFi वॉलेट',
      ETHWallet: 'Ethereum वॉलेट',
      ethWallet: 'ETH वॉलेट',

      dappStore: 'डीएप स्टोर',
    },
  },
  COUNTRY: {
    AT: 'ऑस्ट्रिया (AUT)', // 奥地利
    BE: 'बेल्जियम (BEL)', // 比利时
    BG: 'बुल्गारिया (BGR)', // 保加利亚
    HR: 'क्रोएशिया (HRV)', // 克罗地亚
    CY: 'साइप्रस (CYP)', // 塞浦路斯
    CZ: 'चेक गणराज्य (CZE)', // 捷克
    DK: 'डेनमार्क (DNK)', // 丹麦
    EE: 'एस्टोनिया (EST)', // 爱沙尼亚
    FI: 'फिनलैंड (FIN)', // 芬兰
    FR: 'फ्रांस (FRA)', // 法国
    DE: 'जर्मनी (DEU)', // 德国
    GR: 'यूनान (GRC)', // 希腊
    HU: 'हंगरी (HUN)', // 匈牙利
    IS: 'आइसलैंड (ISL)', // 冰岛
    IE: 'आयरलैंड (IRL)', // 爱尔兰
    IT: 'इटली (ITA)', // 意大利
    LV: 'लातविया (LVA)', // 拉脱维亚
    LT: 'लिथुआनिया (LTU)', // 立陶宛
    LU: 'लक्ज़मबर्ग (LUX)', // 卢森堡
    NL: 'नीदरलैंड्स (NLD)', // 荷兰
    NO: 'नॉर्वे (NOR)', // 挪威
    PL: 'पोलैंड (POL)', // 波兰
    PT: 'पुर्तगाल (PRT)', // 葡萄牙
    RO: 'रोमानिया (ROU)', // 罗马尼亚
    SK: 'स्लोवाकिया (SVK)', // 斯洛伐克
    SI: 'स्लोवेनिया (SVN)', // 斯洛文尼亚
    ES: 'स्पेन (ESP)', // 西班牙
    SE: 'स्वीडन (SWE)', // 瑞典
    CH: 'स्विट्ज़रलैंड (CHE)', // 瑞士
    ZA: 'दक्षिण अफ्रीका', // 南非
    GB: 'इंग्लैंड', // 英格兰
    TR: 'तुर्की', // 土耳其
    REU: 'रीयूनियन (REU)', // 留尼汪岛
    LIE: 'लिकटेंस्टीन (LIE)', // 列支敦士登
    ALA: 'ऑलैंड द्वीप (ALA)', // 奥兰群岛
    support: 'समर्थित',
    coming_soon: 'जल्द आ रहा है',
    Asia: 'एशिया',
    Africa: 'अफ्रीका',
    North_America: 'उत्तरी अमेरिका',
    South_America: 'दक्षिणी अमेरिका',
    Europe: 'यूरोप',
    Australia: 'ऑस्ट्रेलिया',
  },
  FOLLOW: {
    title: 'हमारे पर का पालन करें',
    desc1: 'TokenPocket कर्मचारी आपको निजी संदेश नहीं भेजेंगे!',
    desc2:
      'सावधानी! आप टोकनपॉकेट समुदाय में प्रवेश कर रहे हैं, हो सकता है कि कोई व्यक्ति आपको निजी संदेश भेजने के लिए प्रतिरूपित कर रहा हो! कृपया ध्यान रखें कि निजी संदेश भेजने वाला कोई भी व्यक्ति स्कैमर हो सकता है! हम आपसे पहले कभी संपर्क नहीं करेंगे!',
    desc3: 'समझे, दर्ज करें',
  },
  HOME: {
    TP_card: 'TP कार्ड',
    TP_card_desc: 'एक बैंक कार्ड विकेंद्रीकृत तरीके से संचालित होता है।',
    downloadToGet: 'डाउनलोड करें',
    sectionTitle_1_1:
      'अपने क्रिप्टो का दैनिक जीवन में उपयोग करें, बिना किसी परेशानी के।',
    sectionDesc_1_1:
      'अपनी TokenPocket वॉलेट से अपने TP कार्ड में क्रिप्टो को सुरक्षित और तुरंत फिएट में बदलें। इसे जहां भी जाएं, खर्च करें।',
    sectionTitle_2_1: 'Web2 से Web3 का नया प्लगइन।',
    sectionDesc_2_1: 'अपने TP कार्ड में किसी भी टोकन को जमा करें।',
    sectionDesc_2_2:
      'DeFi प्रोटोकॉल के साथ मिलाकर, आपका कार्ड और भी अधिक लचीला हो सकता है और यहां तक कि अपने आप को भी पार कर सकता है।',
    sectionTitle_3_1: 'जैसा आप हमेशा भुगतान करते हैं,',
    sectionTitle_3_2: 'वैसा ही करें, कुछ नहीं बदलेगा।',
    sectionDesc_3_1: 'Apple Pay, Google Pay और Samsung Pay समर्थित।',
    sectionDesc_3_2:
      'Amazon पर शॉपिंग करें, ChatGPT पर सब्सक्राइब करें और Steam पर खरीदारी करें। ऑनलाइन और ऑफलाइन दोनों समर्थित।',
    regionsCovered: 'कवर किए गए क्षेत्र',
    sectionTitle_4_1: `डिजिटल से वास्तविकता की ओर`,
    sectionTitle_4_2: `${TP_CARD} के साथ`,
    sectionDesc_4_1: 'अपना कार्ड प्राप्त करने के लिए डाउनलोड करें।',
    GET_IT_ON: 'GET IT ON',
    download: 'Download',
    AppStore: 'App Store',
    GooglePlay: 'Google Play',
    AndroidAPK: 'Android APK',
    learnMore: 'और जानें',

    FAQ: {
      title: 'सामान्य प्रश्न',
      checkDetail: 'अधिक विवरण देखने के लिए क्लिक करें>',
      question_1_1: 'TP कार्ड क्या है?',
      answer_1_1:
        'TP Card (Visa) एक डेबिट कार्ड है जिसे TokenPocket और स्विट्ज़रलैंड के एक विनियमित बैंक द्वारा संयुक्त रूप से लॉन्च किया गया है। यह Arbitrum नेटवर्क पर आधारित है, और आपको अपने बैंक कार्ड को विकेंद्रीकृत तरीके से प्रबंधित करने और अपने दैनिक जीवन में क्रिप्टो का उपयोग करने की सुविधा प्रदान करता है।',
      question_2_1: 'TP कार्ड कैसे प्राप्त करें?',
      answer_2_1:
        'TP कार्ड प्राप्त करने के लिए, आपको पहले TokenPocket वॉलेट डाउनलोड करना होगा। Arbitrum वॉलेट "बनाने/आयात करने" के बाद, आपको एक बैंक खाता NFT को मिंट करना होगा। मिंटिंग पूरी होने के बाद, बैंक पंजीकरण प्रक्रिया को पूरा करें। इसके बाद, आपको TP कार्ड प्राप्त होगा और आप इसका उपयोग शुरू कर सकते हैं।',
      question_3_1: 'TP कार्ड के लिए शुल्क क्या हैं?',
      answer_3_1: 'TP Card की फीस मुख्य रूप से दो भागों में विभाजित है:',
      answer_3_2:
        '1. TP Card के लिए एक NFT बनाने के लिए एक शुल्क की आवश्यकता होती है। TokenPocket ने आपके लिए आंशिक रूप से लागत को कवर किया है, लेकिन आपको अभी भी इस शुल्क का एक छोटा हिस्सा देना होगा।',
      answer_3_3:
        '2. TP Card में क्रिप्टो जमा करने पर 1% का शुल्क लिया जाता है।',
      answer_3_4:
        'इनके अलावा, TP Card के लिए कोई अतिरिक्त शुल्क नहीं है। लेनदेन के दौरान होने वाले अतिरिक्त शुल्क सामान्य अंतरबैंक निपटान प्रक्रिया का हिस्सा हैं और TP Card द्वारा वसूला नहीं जाता।',
      answer_4_1:
        '- TP कार्ड प्राप्त करने के बाद, आप इसे Apple Pay, Google Pay, Samsung Pay, Alipay और WeChat Pay में जोड़ सकते हैं, जो ऑफ़लाइन खरीदारी के लिए सुविधाजनक है।',
      answer_4_2:
        '- आप Grab, Amazon और Shopee जैसी प्लेटफार्मों पर ऑनलाइन शॉपिंग और लेनदेन के लिए TP कार्ड का उपयोग भी कर सकते हैं, जैसे कि एक नियमित बैंक कार्ड।',
      answer_4_3:
        '- इसके अलावा, आप इसे App Store, ChatGPT, Steam, Shopify, Notion, Twitter, और Netflix जैसी सदस्यता सेवाओं के लिए भी उपयोग कर सकते हैं।',
      answer_4_4:
        'संक्षेप में, TP कार्ड का उपयोग करना आपके अन्य बैंक कार्ड का उपयोग करने से बहुत अलग नहीं है।',
      question_5_1: 'अब TP कार्ड कौन उपयोग कर सकता है?',
      answer_5_1:
        'वर्तमान में, TP कार्ड (Visa) यूरोप के 32 देशों और क्षेत्रों में पंजीकरण और उपयोग के लिए खुला है। Q4 तक एशिया-प्रशांत क्षेत्र के उपयोगकर्ताओं के लिए पंजीकरण और उपयोग को समर्थन देने की योजना है।',
      question_6_1: 'ऑन-चेन वॉलेट और TP कार्ड के बीच संबंध क्या है?',
      answer_6_1:
        'TP कार्ड एक-से-एक के साथ एक ऑन-चेन वॉलेट से जुड़ा होता है। TP कार्ड की परिसंपत्ति प्रबंधन और पहचान सत्यापन सभी ऑन-चेन वॉलेट के माध्यम से की जा सकती है।',
      question_7_1: 'एकाउंट NFT क्या है और मुझे एक NFT क्यों मिंट करना चाहिए?',
      answer_7_1:
        'Web2 बैंकों द्वारा उपयोग किए गए खाता और पासवर्ड मॉडल के विपरीत, TP कार्ड Web3 वॉलेट सत्यापन का उपयोग करता है। TP कार्ड का उपयोग करने के लिए, आपको एक खाता NFT प्राप्त करना होगा। प्रत्येक खाता NFT में एक अद्वितीय संख्या होती है जो आपके बैंक खाते का प्रतिनिधित्व करती है।',
      question_8_1: 'EUR24, USD24 और CHF24 क्या हैं?',
      answer_8_1:
        'EUR24, USD24 और CHF24 Fiat24 द्वारा जारी ऑन-चेन स्थिर मुद्राएं हैं, जो क्रमशः यूरो, अमेरिकी डॉलर और स्विस फ्रैंक से संबंधित हैं, और उनकी संबंधित फिएट मुद्राओं के साथ 1:1 की विनिमय दर है।',
      answer_8_2:
        'जब आप अपने TP कार्ड को रिचार्ज करते हैं, तो राशि यूरो, डॉलर या स्विस फ्रैंक में बदल जाएगी। इसके अनुरूप, समान राशि के EUR24, USD24 या CHF24 को आपके ऑन-चेन वॉलेट में स्थानांतरित किया जाएगा। आपके ऑन-चेन वॉलेट में मौजूद परिसंपत्तियां आपके TP कार्ड बैलेंस के समान होती हैं। जब भी आप कोई लेनदेन करते हैं, तो आपके ऑन-चेन बैलेंस को स्वचालित रूप से संबंधित राशि से घटाया जाएगा ताकि यह सुनिश्चित हो सके कि यह आपके TP कार्ड के फंड से मेल खाता है।',
      question_9_1:
        'यदि मैं किसी और को EUR24 या USD24 ट्रांसफर करना चाहता हूं, तो क्या उनके बैंक कार्ड का बैलेंस बढ़ जाएगा? मुझे किस बात का ध्यान रखना चाहिए?',
      answer_9_1:
        'किसी और को EUR24 या USD24 ट्रांसफर करने के लिए, प्राप्तकर्ता का पता एकाउंट NFT होना चाहिए और बैंक पंजीकरण पूरा होना चाहिए। अन्यथा, आपका ट्रांसफर असफल हो जाएगा।',
      answer_9_2:
        'यदि प्राप्तकर्ता ने बैंक पंजीकरण पूरा कर लिया है, तो EUR24 या USD24 को उनके खाते में ट्रांसफर करना एक बैंक ट्रांसफर करने के बराबर है। इसके अनुरूप, उनकी परिसंपत्ति का बैलेंस बढ़ जाएगा।',
      question_10_1:
        'क्या मैं अपनी TP कार्ड से जुड़ी वॉलेट को बदल सकता हूँ? क्या मेरी परिसंपत्तियां खो जाएंगी? इसे कैसे करें?',
      answer_10_1:
        'हां, आप अपनी TP कार्ड से जुड़ी वॉलेट को बदल सकते हैं और आपकी परिसंपत्तियां नहीं खोएंगी। इन चरणों का पालन करें:',
      answer_10_2:
        '- सबसे पहले, आपको अपने TP कार्ड NFT को नए वॉलेट पते पर ट्रांसफर करना होगा।',
      answer_10_3:
        '- TP कार्ड को ट्रांसफर करने के बाद, अपने EUR24, USD24 और अन्य परिसंपत्तियों को उसी नए पते पर ट्रांसफर करें।',
      answer_10_4:
        '- एक बार ये ट्रांसफर पूरे हो जाने के बाद, आपका TP कार्ड नए वॉलेट से जुड़ा होगा और सभी परिसंपत्तियां नए पते के अधीन हो जाएंगी।',
      question_11_1: 'मेरी वॉलेट में कितने एकाउंट NFT मिंट कर सकते हैं?',
      answer_11_1:
        'एक वॉलेट में केवल एक एकाउंट NFT हो सकता है। यदि आपके वॉलेट में पहले से ही एक एकाउंट NFT है, तो आप दूसरा नहीं मिंट कर सकते। इसके अलावा, आप खरीदारी के माध्यम से अधिक एकाउंट NFT प्राप्त नहीं कर सकते।',
      question_12_1:
        'अगर मेरा बैंक कार्ड फ्रीज हो गया है तो मुझे क्या करना चाहिए?',
      answer_12_1:
        'यदि आपका बैंक खाता इंगित करता है कि यह फ्रीज हो गया है, तो कृपया Fiat24 से संपर्क करें ताकि कारण की जांच और बाद की प्रक्रियाओं में सहायता प्राप्त की जा सके।',
      answer_12_2: 'Fiat24 ग्राहक सेवा संपर्क: service@fiat24.com',
      question_13_1:
        'मैं रिफंड के लिए कैसे आवेदन कर सकता हूँ? रिफंड को संसाधित करने में कितना समय लगेगा?',
      answer_13_1:
        'यदि आप किसी लेनदेन के लिए रिफंड का अनुरोध करते हैं, तो रिफंड व्यापारी द्वारा रिफंड प्रक्रिया को पूरा करने के 3-5 कार्यदिवसों के भीतर आपके बैंक खाते में वापस कर दिया जाएगा। कृपया इस अवधि के दौरान धैर्य रखें। यदि आपको सहायता की आवश्यकता है, तो कृपया Fiat24 ग्राहक सेवा से संपर्क करें: service@fiat24.com',
    },
  },
  VIP: {
    title: 'About VIPs',
    introduce_1:
      'User levels are determined by earned points: higher points lead to higher levels, resulting in lower deposit fees and higher referral rates.',
    introduce_2:
      'Points are accumulated through deposits, invitations.',
    introduce_3:
      'Your level is updated in real-time based on your total points over the past three months and reassessed daily at 00:00 UTC.',
    text_1: 'VIPs & Benefits：',
    text_2: 'Point',
    text_3: 'Fee',
    text_4: 'Referral',
    text_5: 'Extra Benefit for Premium：',
    text_6: '- Deposit fee reduced by an additional 0.1%',
    text_7: '- Referral rewards increased by an additional 10%',
  },
  REFPOINT: {
    title: 'Deposit to Earn Points',
    title_1:
      'You can earn points through deposits; the more you deposit, the more points you earn, with no limit.',
    desc_1:
      '- For every 100 USDC deposited, users earn 100 points, with a minimum unit of 1 point.',
    desc_2:
      '- Points take effect immediately and are valid for 3 months. Points older than 3 months will be automatically discarded.',
  },
};
