const TP_CARD = '<span style="color: #2980fe">TP Карта</span>';
export default {
  COMMON: {
    LAYOUT: {
      features: 'Особенности',
      products: 'Продукты',
      buyCryptoFooter: 'Покупка',
      mobileWallet: 'Мобильный кошелек',
      mobileWalletDesc: 'Крипто и DeFi мобильный кошелек на блокчейне.',
      hardwareWallet: 'Аппаратный кошелек',
      hardwareWalletDesc: 'Получите KeyPal, чтобы защитить ваши активы.',
      TPCard: 'TP Карта',
      TPCardDesc: 'Банковская карта работает в децентрализованной манере.',
      extensionWallet: 'Расширение кошелька',
      extensionWalletDesc: 'Удобный кошелек для вашего компьютера.',
      desktop: 'Desktop Wallet',
      fiveDegrees: '5Degrees',
      versionVerification: 'Проверка версии',
      versionVerificationDesc: 'Проверьте ваш кошелек.',
      approvalDetector: 'Обнаружение одобрений',
      approvalDetectorDesc:
        'Просматривайте и отменяйте одобрения ваших токенов.',
      tokenSecurity: 'Безопасность токенов',
      tokenSecurityDesc:
        'Проверьте безопасность токена по его адресу контракта.',
      keyGenerator: 'Генератор ключей',
      keyGeneratorDesc:
        'Генерация случайных публичных и приватных ключей для сетей.',
      tokenProfile: 'Профиль токена',
      tokenProfileDesc: 'Узнайте всю информацию о токене.',
      tokenClaim: 'Запрос токенов',
      tokenClaimDesc: 'Запросите ваш airdrop.',
      easyInscription: 'Легкая надпись',
      easyInscriptionDesc: 'Безопасный инструмент для надписей.',
      nostrAssetsBatchSender: 'NostrAssets BatchSender',
      nostrAssetsBatchSenderDesc:
        'Инструмент массовой отправки для NostrAssets.',
      BATCH_SENDER: 'BatchSender',
      BATCH_SENDER_DESC:
        'Отправляйте токены нескольким получателям одновременно.',

      trade: 'Торговля',
      swap: 'Обмен',
      swapDesc: 'Торгуйте по лучшим ценам.',
      bridge: 'Мост',
      bridgeDesc: 'Легко переводите активы с одной цепочки на другую.',
      buyCrypto: 'Покупка',
      buyCryptoDesc: 'Покупайте криптовалюту с помощью кредитных карт.',
      market: 'Рынок',
      marketDesc: 'Мгновенные данные для обнаружения популярных токенов.',

      information: 'Информация',
      blockchainGuide: 'Руководство по блокчейну',
      tronWallet: 'Руководство по TRON',
      iostWallet: 'Руководство по IOST',
      tpMan: 'ТП-мужчина',

      developers: 'Разработчики',
      github: 'Github (TP-Lab)',
      devCenter: 'Центр разработки',
      developersDesc: 'Документация для разработчиков TokenPocket.',
      subToken: 'Отправить токен',
      subTokenDesc: 'Отправьте ваш токен.',
      subDApp: 'Отправить DApp',
      subDAppDesc: 'Отправьте ваше DApp, и оно будет отображено после аудита.',
      subNFT: 'Отправить NFT',
      subNFTDesc: 'Отправьте ваши NFT и произведения искусства.',
      subChain: 'Отправить цепочку',
      subChainDesc: 'Отправьте вашу блокчейн.',
      bugBounty: 'Bug Bounty',

      tools: 'Инструменты',

      build: 'Разработка',

      learn: 'Учиться',

      explorer: 'Проводник',
      darkMode: 'Темный режим',

      company: 'Компания',
      about: 'О',
      careers: 'Карьера',
      pressKit: 'Бренд-кит',
      swagShop: 'Магазин сувениров',

      support: 'Поддержка',
      helpCenter: 'Центр помощи',
      helpCenterDesc: 'Ваши ресурсы для получения ответов и помощи.',
      contactUs: 'Свяжитесь с нами',
      contactUsDesc: 'Делитесь своими предложениями и задавайте любые вопросы.',
      forum: 'Форум',
      forumDesc: 'Наслаждайтесь беседами с членами сообщества.',

      legal: 'Юридический',
      privacyPolicy: 'Политика конфиденциальности',
      terms: 'Условия использования',

      toHome: 'Дом',
      defiWallet: 'Кошелек DeFi',
      ETHWallet: 'Кошелек Эфириума',
      ethWallet: 'ETH-кошелек',

      dappStore: 'DApp магазин',
    },
  },
  COUNTRY: {
    AT: 'Австрия (AUT)', // 奥地利
    BE: 'Бельгия (BEL)', // 比利时
    BG: 'Болгария (BGR)', // 保加利亚
    HR: 'Хорватия (HRV)', // 克罗地亚
    CY: 'Кипр (CYP)', // 塞浦路斯
    CZ: 'Чехия (CZE)', // 捷克
    DK: 'Дания (DNK)', // 丹麦
    EE: 'Эстония (EST)', // 爱沙尼亚
    FI: 'Финляндия (FIN)', // 芬兰
    FR: 'Франция (FRA)', // 法国
    DE: 'Германия (DEU)', // 德国
    GR: 'Греция (GRC)', // 希腊
    HU: 'Венгрия (HUN)', // 匈牙利
    IS: 'Исландия (ISL)', // 冰岛
    IE: 'Ирландия (IRL)', // 爱尔兰
    IT: 'Италия (ITA)', // 意大利
    LV: 'Латвия (LVA)', // 拉脱维亚
    LT: 'Литва (LTU)', // 立陶宛
    LU: 'Люксембург (LUX)', // 卢森堡
    NL: 'Нидерланды (NLD)', // 荷兰
    NO: 'Норвегия (NOR)', // 挪威
    PL: 'Польша (POL)', // 波兰
    PT: 'Португалия (PRT)', // 葡萄牙
    RO: 'Румыния (ROU)', // 罗马尼亚
    SK: 'Словакия (SVK)', // 斯洛伐克
    SI: 'Словения (SVN)', // 斯洛文尼亚
    ES: 'Испания (ESP)', // 西班牙
    SE: 'Швеция (SWE)', // 瑞典
    CH: 'Швейцария (CHE)', // 瑞士
    ZA: 'Южная Африка', // 南非
    GB: 'Англия', // 英格兰
    TR: 'Турция', // 土耳其
    AU: 'Австралия', // 澳大利亚
    NZ: 'Новая Зеландия', // 新西兰
    REU: 'Реюньон (REU)', // 留尼汪岛
    LIE: 'Лихтенштейн (LIE)', // 列支敦士登
    ALA: 'Аландские острова (ALA)', // 奥兰群岛
    support: 'Поддерживается',
    coming_soon: 'Скоро',
    Asia: 'Азия',
    Africa: 'Африка',
    North_America: 'Северная Америка',
    South_America: 'Южная Америка',
    Europe: 'Европа',
    Australia: 'Австралия',
  },
  FOLLOW: {
    title: 'Подписывайтесь на нас',
    desc1: 'Сотрудники TokenPocket не будут отправлять вам личные сообщения!',
    desc2:
      'Осторожность! Вы входите в сообщество TokenPocket, возможно, кто-то выдает себя за нас, чтобы отправлять вам личные сообщения! Имейте в виду, что любой, кто отправляет личные сообщения, может быть мошенником! Мы никогда не свяжемся с вами первыми!',
    desc3: 'Понятно, вводите',
  },
  HOME: {
    TP_card: 'TP Карта',
    TP_card_desc: 'Банковская карта работает в децентрализованной манере.',
    downloadToGet: 'Загрузить',
    sectionTitle_1_1:
      'Используйте криптовалюту в повседневной жизни, без проблем.',
    sectionDesc_1_1:
      'Конвертируйте криптовалюту в фиатные деньги безопасно и мгновенно из вашего кошелька TokenPocket на вашу TP карту. Тратьте их где угодно.',
    sectionTitle_2_1: 'Новый плагин Web3 из Web2.',
    sectionDesc_2_1: 'Поддерживает депозит любых токенов на вашу TP карту.',
    sectionDesc_2_2:
      'В сочетании с протоколами DeFi, ваша карта может стать более гибкой и даже выйти за её рамки.',
    sectionTitle_3_1: 'Платите как обычно,',
    sectionTitle_3_2: 'ничего не изменится.',
    sectionDesc_3_1: 'Поддерживаются Apple Pay, Google Pay и Samsung Pay.',
    sectionDesc_3_2:
      'Покупки на Amazon, подписка на ChatGPT и покупки на Steam. Поддерживаются как онлайн, так и оффлайн.',
    regionsCovered: 'Охваченные регионы',
    sectionTitle_4_1: `От цифрового к реальному`,
    sectionTitle_4_2: `с ${TP_CARD}й`,
    sectionDesc_4_1: 'Загрузите, чтобы получить свою карту.',
    GET_IT_ON: 'GET IT ON',
    download: 'Download',
    AppStore: 'App Store',
    GooglePlay: 'Google Play',
    AndroidAPK: 'Android APK',
    learnMore: 'Узнать больше',

    FAQ: {
      title: 'Часто задаваемые вопросы',
      checkDetail: 'Щелкните, чтобы узнать подробности>',
      question_1_1: 'Что такое TP Карта?',
      answer_1_1:
        'TP Card (Visa) – это дебетовая карта, совместно выпущенная TokenPocket и регулируемым банком из Швейцарии. Она основана на сети Arbitrum и позволяет управлять своей банковской картой в децентрализованном режиме, а также удобно использовать криптовалюту в повседневной жизни.',
      question_2_1: 'Как получить TP Карту?',
      answer_2_1:
        'Для получения TP Карты сначала нужно загрузить кошелек TokenPocket. После "создания/импорта" кошелька Arbitrum, нужно создать NFT банковского счета. После завершения создания завершите процесс регистрации в банке. Затем вы получите TP Карту и сможете начать её использование.',
      question_3_1: 'Какие комиссии у TP Карты?',
      answer_3_1: 'Комиссия за использование TP Card в основном состоит из двух частей:',
      answer_3_2:
        '1. За создание NFT для TP Card взимается плата. TokenPocket частично покрывает расходы, но вам все же нужно оплатить небольшую часть.',
      answer_3_3:
        '2. При пополнении TP Card криптовалютой взимается комиссия в размере 1%.',
      answer_3_4:
        'Кроме этих сборов, дополнительных платежей за использование TP Card нет. Любые дополнительные комиссии, возникающие во время транзакций, являются частью обычного процесса межбанковских расчетов и не взимаются TP Card.',
      question_4_1: 'Какие варианты использования TP Карты?',
      answer_4_1:
        '- После получения TP Карты вы можете добавить её в Apple Pay, Google Pay, Samsung Pay, Alipay и WeChat Pay, что удобно для оффлайн покупок.',
      answer_4_2:
        '- Вы также можете использовать TP Карту для онлайн покупок и транзакций, как обычную банковскую карту, на таких платформах, как Grab, Amazon и Shopee.',
      answer_4_3:
        '- Кроме того, вы можете использовать её для подписки на такие сервисы, как App Store, ChatGPT, Steam, Shopify, Notion, Twitter и Netflix.',
      answer_4_4:
        'В общем, использование TP Карты не сильно отличается от использования других банковских карт.',
      question_5_1: 'Кто сейчас может использовать TP Карту?',
      answer_5_1:
        'В настоящее время TP Карта (Visa) доступна для регистрации и использования в 32 странах и регионах Европы. Планируется поддержка регистрации и использования для пользователей в Азиатско-Тихоокеанском регионе к четвертому кварталу.',
      question_6_1: 'Какова связь между ончейн кошельком и TP Картой?',
      answer_6_1:
        'TP Карта связана один-к-одному с ончейн кошельком. Управление активами и проверка личности TP Карты могут осуществляться через ончейн кошелек.',
      question_7_1: 'Что такое аккаунт NFT и зачем нужно создавать NFT?',
      answer_7_1:
        'В отличие от модели учетной записи и пароля, используемой банками Web2, TP Card использует верификацию Web3-кошелька. Чтобы использовать TP Card, необходимо получить NFT учетной записи. Каждое NFT учетной записи имеет уникальный номер, представляющий ваш банковский счет.',
      question_8_1: 'Что такое EUR24, USD24 и CHF24?',
      answer_8_1:
        'EUR24, USD24 и CHF24 — это ончейн стейблкоины, выпущенные Fiat24, привязанные соответственно к евро, доллару США и швейцарскому франку, с обменным курсом 1:1 к соответствующим фиатным валютам.',
      answer_8_2:
        'При пополнении TP Карты сумма конвертируется в евро, доллары или швейцарские франки. Соответственно, эквивалентная сумма EUR24, USD24 или CHF24 будет переведена на ваш ончейн кошелек. Активы в вашем ончейн кошельке эквивалентны балансу TP Карты. При каждой транзакции ваш ончейн баланс будет автоматически списываться на соответствующую сумму, чтобы обеспечить соответствие средств на TP Карте.',
      question_9_1:
        'Если я захочу перевести EUR24 или USD24 другому человеку, увеличится ли баланс его банковской карты? На что стоит обратить внимание?',
      answer_9_1:
        'Чтобы перевести EUR24 или USD24 другому человеку, адрес получателя должен иметь аккаунт NFT и завершить регистрацию в банке. В противном случае ваш перевод не удастся.',
      answer_9_2:
        'Если получатель завершил регистрацию в банке, перевод EUR24 или USD24 на его счет эквивалентен банковскому переводу. Соответственно, его баланс активов увеличится.',
      question_10_1:
        'Могу ли я изменить кошелек, связанный с моей TP Картой? Будут ли потеряны мои активы? Как это сделать?',
      answer_10_1:
        'Да, вы можете изменить кошелек, связанный с вашей TP Картой, и ваши активы не будут потеряны. Следуйте этим шагам:',
      answer_10_2:
        '- Сначала вам нужно перевести NFT TP Карты на новый адрес кошелька.',
      answer_10_3:
        '- После перевода TP Карты переведите ваши EUR24, USD24 и другие активы на тот же новый адрес.',
      answer_10_4:
        '- Как только эти переводы будут завершены, TP Карта будет связана с новым кошельком, и все активы будут находиться на новом адресе.',
      question_11_1: 'Сколько аккаунт NFT может выпустить мой кошелек?',
      answer_11_1:
        'Кошелек может держать только один аккаунт NFT. Если ваш кошелек уже содержит аккаунт NFT, вы не сможете создать другой. Также вы не можете приобрести больше аккаунт NFT через покупку.',
      question_12_1: 'Что делать, если моя банковская карта заморожена?',
      answer_12_1:
        'Если ваш банковский счет указывает, что он заморожен, свяжитесь с Fiat24 для помощи в расследовании причины и последующих действий.',
      answer_12_2:
        'Контактная информация службы поддержки Fiat24: service@fiat24.com',
      question_13_1:
        'Как подать заявку на возврат средств? Сколько времени займет обработка возврата?',
      answer_13_1:
        'Если вы запросили возврат средств по транзакции, возврат будет зачислен на ваш банковский счет в течение 3-5 рабочих дней после завершения процесса возврата продавцом. Пожалуйста, будьте терпеливы в этот период. Если вам нужна помощь, свяжитесь со службой поддержки Fiat24: service@fiat24.com',
    },
  },
  VIP: {
    title: 'About VIPs',
    introduce_1:
      'User levels are determined by earned points: higher points lead to higher levels, resulting in lower deposit fees and higher referral rates.',
    introduce_2:
      'Points are accumulated through deposits, invitations.',
    introduce_3:
      'Your level is updated in real-time based on your total points over the past three months and reassessed daily at 00:00 UTC.',
    text_1: 'VIPs & Benefits：',
    text_2: 'Point',
    text_3: 'Fee',
    text_4: 'Referral',
    text_5: 'Extra Benefit for Premium：',
    text_6: '- Deposit fee reduced by an additional 0.1%',
    text_7: '- Referral rewards increased by an additional 10%',
  },
  REFPOINT: {
    title: 'Deposit to Earn Points',
    title_1:
      'You can earn points through deposits; the more you deposit, the more points you earn, with no limit.',
    desc_1:
      '- For every 100 USDC deposited, users earn 100 points, with a minimum unit of 1 point.',
    desc_2:
      '- Points take effect immediately and are valid for 3 months. Points older than 3 months will be automatically discarded.',
  },
};
