const TP_CARD = '<span style="color: #2980fe">TP Card</span>'
export default {
  COMMON: {
    LAYOUT: {
      features: 'คุณสมบัติ',
      products: 'สินค้า',
      buyCryptoFooter: 'ซื้อ',
      mobileWallet: 'กระเป๋าเงินบนมือถือ',
      mobileWalletDesc: 'กระเป๋าเงินมือถือ Crypto & DeFi บนบล็อกเชน',
      hardwareWallet: 'กระเป๋าเงินฮาร์ดแวร์',
      hardwareWalletDesc: 'รับ KeyPal ของคุณ เพื่อปกป้องทรัพย์สินของคุณ',
      TPCard: 'บัตร TP',
      TPCardDesc: 'บัตรธนาคารที่ดำเนินการแบบกระจายศูนย์.',
      extensionWallet: 'กระเป๋าเงินสำหรับเบราว์เซอร์',
      extensionWalletDesc: 'กระเป๋าเงินที่ดีกว่าบนคอมพิวเตอร์ของคุณ',
      desktop: 'Desktop Wallet',
      fiveDegrees: '5Degrees',
      versionVerification: 'การตรวจสอบเวอร์ชัน',
      versionVerificationDesc: 'ตรวจสอบกระเป๋าเงินของคุณ',
      approvalDetector: 'ตรวจจับการอนุมัติ',
      approvalDetectorDesc: 'ดูและยกเลิกการอนุมัติโทเค็นของคุณที่ได้รับอนุมัติ',
      tokenSecurity: 'ความปลอดภัยของโทเค็น',
      tokenSecurityDesc: 'ตรวจสอบว่าโทเค็นปลอดภัยหรือไม่ด้วยที่อยู่สัญญาของมัน',
      keyGenerator: 'ตัวสร้างคีย์',
      keyGeneratorDesc: 'สร้างคีย์สาธารณะและส่วนตัวแบบสุ่มสำหรับเครือข่ายต่างๆ',
      tokenProfile: 'โปรไฟล์โทเค็น',
      tokenProfileDesc: 'เรียนรู้ข้อมูลทั้งหมดเกี่ยวกับโทเค็น',
      tokenClaim: 'การเรียกร้องโทเค็น',
      tokenClaimDesc: 'เรียกร้องแอร์ดรอปของคุณ',
      easyInscription: 'การจารึกอย่างง่าย',
      easyInscriptionDesc: 'เครื่องมือการจารึกที่ปลอดภัย',
      nostrAssetsBatchSender: 'NostrAssets BatchSender',
      nostrAssetsBatchSenderDesc: 'เครื่องมือการส่งแบบกลุ่มสำหรับ NostrAssets',
      BATCH_SENDER: 'BatchSender',
      BATCH_SENDER_DESC: 'ส่งโทเค็นไปยังผู้รับหลายรายพร้อมกัน',

      trade: 'การซื้อขาย',
      swap: 'แลกเปลี่ยน',
      swapDesc: 'ซื้อขายด้วยราคาที่ดีที่สุด',
      bridge: 'บริดจ์',
      bridgeDesc: 'ข้ามทรัพย์สินจากเชนหนึ่งไปยังอีกเชนหนึ่งอย่างราบรื่น',
      buyCrypto: 'ซื้อ',
      buyCryptoDesc: 'ซื้อสกุลเงินดิจิทัลด้วยบัตรเครดิตของคุณ',
      market: 'ตลาด',
      marketDesc: 'ข้อมูลเชิงลึกแบบเรียลไทม์เพื่อค้นหาโทเค็นที่น่าสนใจ',

      information: 'ข้อมูล',
      blockchainGuide: 'คู่มือบล็อคเชน',
      tronWallet: 'คู่มือ TRON',
      iostWallet: 'คู่มือ IOST',
      tpMan: 'ชาย TP',

      developers: 'นักพัฒนา',
      github: 'Github (TP-Lab)',
      devCenter: 'ศูนย์นักพัฒนา',
      developersDesc: 'เอกสารสำหรับนักพัฒนา TokenPocket',
      subToken: 'ส่งโทเค็น',
      subTokenDesc: 'ส่งโทเค็นของคุณ',
      subDApp: 'ส่ง DApp',
      subDAppDesc: 'ส่ง DApp ของคุณและแสดงหลังจากการตรวจสอบ',
      subNFT: 'ส่ง NFT',
      subNFTDesc: 'ส่ง NFT และศิลปะของคุณ',
      subChain: 'ส่งเชน',
      subChainDesc: 'ส่งบล็อกเชนของคุณ',
      bugBounty: 'Bug Bounty',

      tools: 'เครื่องมือ',

      build: 'สร้าง',

      learn: 'เรียนรู้',

      explorer: 'ตัวสำรวจ',
      darkMode: 'โหมดมืด',

      company: 'บริษัท',
      about: 'กี่ยวกับ',
      careers: 'อาชีพ',
      pressKit: 'ชุดแบรนด์',
      swagShop: 'Swag Shop',

      support: 'การสนับสนุน',
      helpCenter: 'ศูนย์ช่วยเหลือ',
      helpCenterDesc: 'ทรัพยากรหลักของคุณสำหรับคำตอบและความช่วยเหลือ',
      contactUs: 'ติดต่อเรา',
      contactUsDesc: 'แชร์คำแนะนำของคุณและถามคำถามใด ๆ',
      forum: 'ฟอรั่ม',
      forumDesc: 'เพลิดเพลินไปกับการสนทนากับสมาชิกในชุมชน',

      legal: 'ถูกกฎหมาย',
      privacyPolicy: 'นโยบายความเป็นส่วนตัว',
      terms: 'ข้อกำหนดการใช้งาน',

      toHome: 'บ้าน',
      defiWallet: 'กระเป๋าเงินDeFi',
      ETHWallet: 'กระเป๋าเงินEthereum',
      ethWallet: 'กระเป๋าเงินETH',

      dappStore: 'ร้านค้า DApp',
    },
  },
  COUNTRY: {
    AT: 'ออสเตรีย (AUT)', // 奥地利
    BE: 'เบลเยียม (BEL)', // 比利时
    BG: 'บัลแกเรีย (BGR)', // 保加利亚
    HR: 'โครเอเชีย (HRV)', // 克罗地亚
    CY: 'ไซปรัส (CYP)', // 塞浦路斯
    CZ: 'สาธารณรัฐเช็ก (CZE)', // 捷克
    DK: 'เดนมาร์ก (DNK)', // 丹麦
    EE: 'เอสโตเนีย (EST)', // 爱沙尼亚
    FI: 'ฟินแลนด์ (FIN)', // 芬兰
    FR: 'ฝรั่งเศส (FRA)', // 法国
    DE: 'เยอรมนี (DEU)', // 德国
    GR: 'กรีซ (GRC)', // 希腊
    HU: 'ฮังการี (HUN)', // 匈牙利
    IS: 'ไอซ์แลนด์ (ISL)', // 冰岛
    IE: 'ไอร์แลนด์ (IRL)', // 爱尔兰
    IT: 'อิตาลี (ITA)', // 意大利
    LV: 'ลัตเวีย (LVA)', // 拉脱维亚
    LT: 'ลิทัวเนีย (LTU)', // 立陶宛
    LU: 'ลักเซมเบิร์ก (LUX)', // 卢森堡
    NL: 'เนเธอร์แลนด์ (NLD)', // 荷兰
    NO: 'นอร์เวย์ (NOR)', // 挪威
    PL: 'โปแลนด์ (POL)', // 波兰
    PT: 'โปรตุเกส (PRT)', // 葡萄牙
    RO: 'โรมาเนีย (ROU)', // 罗马尼亚
    SK: 'สโลวาเกีย (SVK)', // 斯洛伐克
    SI: 'สโลวีเนีย (SVN)', // 斯洛文尼亚
    ES: 'สเปน (ESP)', // 西班牙
    SE: 'สวีเดน (SWE)', // 瑞典
    CH: 'สวิตเซอร์แลนด์ (CHE)', // 瑞士
    ZA: 'แอฟริกาใต้', // 南非
    GB: 'อังกฤษ', // 英格兰
    TR: 'ตุรกี', // 土耳其
    AU: 'ออสเตรเลีย', // 澳大利亚
    NZ: 'นิวซีแลนด์', // 新西兰
    REU: 'เรอูนียง (REU)', // 留尼汪岛
    LIE: 'ลิกเตนสไตน์ (LIE)', // 列支敦士登
    ALA: 'หมู่เกาะโอลันด์ (ALA)', // 奥兰群岛
    support: 'สนับสนุน',
    coming_soon: 'เร็ว ๆ นี้',
    Asia: 'เอเชีย',
    Africa: 'แอฟริกา',
    North_America: 'อเมริกาเหนือ',
    South_America: 'อเมริกาใต้',
    Europe: 'ยุโรป',
    Australia: 'ออสเตรเลีย',
  },
  FOLLOW: {
    title: 'ตามเรามา',
    desc1: 'พนักงาน TokenPocket จะไม่ส่งข้อความส่วนตัวถึงคุณ!',
    desc2:
      'คำเตือน! คุณกำลังเข้าสู่ชุมชน TokenPocket อาจมีใครบางคนแอบอ้างเราเพื่อส่งข้อความส่วนตัวถึงคุณ! โปรดทราบว่าทุกคนที่ส่งข้อความส่วนตัวอาจเป็นสแกมเมอร์! เราจะไม่ติดต่อคุณก่อน!',
    desc3: 'เข้าใจแล้ว ป้อน',
  },
  HOME: {
    TP_card: 'บัตร TP',
    TP_card_desc: 'บัตรธนาคารที่ดำเนินการแบบกระจายศูนย์.',
    downloadToGet: 'ดาวน์โหลดเพื่อรับ',
    sectionTitle_1_1: 'ใช้คริปโตในชีวิตประจำวันของคุณได้อย่างราบรื่น.',
    sectionDesc_1_1:
      'แปลงคริปโตเป็นเงินเฟียตอย่างปลอดภัยและทันทีจากกระเป๋าเงิน TokenPocket ของคุณไปยังบัตร TP ของคุณ. ใช้ได้ทุกที่ที่คุณไป.',
    sectionTitle_2_1: 'ปลั๊กอินใหม่ของ Web3 จาก Web2.',
    sectionDesc_2_1: 'รองรับโทเค็นทุกชนิดเพื่อฝากเข้าในบัตร TP ของคุณ.',
    sectionDesc_2_2:
      'รวมกับโปรโตคอล DeFi การ์ดของคุณจะมีความยืดหยุ่นมากขึ้นและอาจเกินกว่าที่คาด.',
    sectionTitle_3_1: 'จ่ายเหมือนเดิม,',
    sectionTitle_3_2: 'ไม่มีอะไรเปลี่ยนแปลง.',
    sectionDesc_3_1: 'รองรับ Apple Pay, Google Pay & Samsung Pay.',
    sectionDesc_3_2:
      'ช้อปปิ้งบน Amazon, สมัครสมาชิก ChatGPT และซื้อสินค้าบน Steam. รองรับทั้งออนไลน์และออฟไลน์.',
    regionsCovered: 'พื้นที่ที่ครอบคลุม',
    sectionTitle_4_1: `จากดิจิทัลสู่ความเป็นจริง`,
    sectionTitle_4_2: `ด้วย ${TP_CARD}`,
    sectionDesc_4_1: 'ดาวน์โหลดเพื่อรับบัตรของคุณ.',
    GET_IT_ON: 'GET IT ON',
    download: 'Download',
    AppStore: 'App Store',
    GooglePlay: 'Google Play',
    AndroidAPK: 'Android APK',
    learnMore: 'เรียนรู้เพิ่มเติม',

    FAQ: {
      title: 'คำถามที่พบบ่อย',
      checkDetail: 'คลิกเพื่อดูรายละเอียดเพิ่มเติม>',
      question_1_1: 'บัตร TP คืออะไร?',
      answer_1_1:
        'TP Card (Visa) เป็นบัตรเดบิตที่เปิดตัวร่วมกันโดย TokenPocket และธนาคารที่ได้รับการรับรองจากประเทศสวิตเซอร์แลนด์ โดยใช้เครือข่าย Arbitrum ช่วยให้คุณจัดการบัตรธนาคารในรูปแบบกระจายศูนย์ และสะดวกต่อการใช้คริปโตในชีวิตประจำวันของคุณ.',
      question_2_1: 'จะรับบัตร TP ได้อย่างไร?',
      answer_2_1:
        'ในการรับบัตร TP คุณต้องดาวน์โหลดกระเป๋าเงิน TokenPocket ก่อน. หลังจาก "สร้าง/นำเข้า" กระเป๋าเงิน Arbitrum คุณต้องทำการสร้าง NFT บัญชีธนาคาร. เมื่อการสร้างเสร็จสิ้น โปรดทำกระบวนการลงทะเบียนธนาคารให้เสร็จสมบูรณ์. หลังจากนั้น คุณจะได้รับบัตร TP และสามารถเริ่มใช้งานได้.',
      question_3_1: 'ค่าธรรมเนียมของบัตร TP คืออะไร?',
      answer_3_1: 'ค่าธรรมเนียมสำหรับ TP Card ประกอบด้วย 2 ส่วนหลัก: ',
      answer_3_2:
        '1.  การสร้าง NFT สำหรับ TP Card ต้องเสียค่าธรรมเนียม ซึ่ง TokenPocket ได้ช่วยครอบคลุมบางส่วน แต่คุณยังคงต้องจ่ายค่าธรรมเนียมส่วนเล็ก ๆ',
      answer_3_3: '2. มีการเก็บค่าธรรมเนียม 1% เมื่อคุณฝากคริปโตเข้าบัญชี TP Card',
      answer_3_4:
        'นอกเหนือจากนี้ จะไม่มีการคิดค่าธรรมเนียมเพิ่มเติมใด ๆ สำหรับ TP Card ค่าธรรมเนียมอื่น ๆ ที่เกิดขึ้นระหว่างการทำธุรกรรมเป็นส่วนหนึ่งของกระบวนการชำระเงินระหว่างธนาคาร และไม่ได้เรียกเก็บโดย TP Card',
      answer_4_1:
        '- หลังจากได้รับบัตร TP คุณสามารถเพิ่มมันใน Apple Pay, Google Pay, Samsung Pay, Alipay และ WeChat Pay ทำให้การซื้อสินค้าออฟไลน์ง่ายขึ้น.',
      answer_4_2:
        '- คุณยังสามารถใช้บัตร TP สำหรับการซื้อสินค้าออนไลน์และการทำธุรกรรมเช่นเดียวกับบัตรธนาคารปกติบนแพลตฟอร์มเช่น Grab, Amazon และ Shopee.',
      answer_4_3:
        '- นอกจากนี้ คุณยังสามารถใช้มันสำหรับบริการสมัครสมาชิก เช่น App Store, ChatGPT, Steam, Shopify, Notion, Twitter และ Netflix.',
      answer_4_4:
        'สรุปแล้ว การใช้บัตร TP ไม่ได้แตกต่างจากการใช้บัตรธนาคารอื่น ๆ ของคุณมากนัก.',
      question_5_1: 'ใครสามารถใช้บัตร TP ได้ในขณะนี้?',
      answer_5_1:
        'ขณะนี้ บัตร TP (Visa) เปิดให้ลงทะเบียนและใช้งานได้ใน 32 ประเทศและภูมิภาคในยุโรป. มีแผนที่จะรองรับการลงทะเบียนและการใช้งานสำหรับผู้ใช้ในภูมิภาคเอเชียแปซิฟิกภายในไตรมาสที่ 4.',
      question_6_1:
        'ความสัมพันธ์ระหว่างกระเป๋าเงิน On-Chain และบัตร TP คืออะไร?',
      answer_6_1:
        'บัตร TP เชื่อมโยงแบบหนึ่งต่อหนึ่งกับกระเป๋าเงิน on-chain. การจัดการสินทรัพย์และการยืนยันตัวตนของบัตร TP สามารถดำเนินการผ่านกระเป๋าเงิน on-chain.',
      question_7_1: 'NFT บัญชีคืออะไร และทำไมต้องสร้าง NFT?',
      answer_7_1:
        'แตกต่างจากโมเดลบัญชีและรหัสผ่านที่ใช้โดยธนาคาร Web2 บัตร TP ใช้การยืนยันกระเป๋าเงิน Web3 ในการใช้บัตร TP คุณต้องได้รับบัญชี NFT แต่ละบัญชี NFT มีหมายเลขเฉพาะที่แสดงถึงบัญชีธนาคารของคุณ.',
      question_8_1: 'EUR24, USD24 และ CHF24 คืออะไร?',
      answer_8_1:
        'EUR24, USD24 และ CHF24 เป็น stablecoin on-chain ที่ออกโดย Fiat24 ซึ่งมีการผูกมัดกับยูโร ดอลลาร์สหรัฐ และฟรังก์สวิสตามลำดับ โดยมีอัตราแลกเปลี่ยน 1:1 กับสกุลเงิน fiat ที่เกี่ยวข้อง.',
      answer_8_2:
        'เมื่อคุณเติมเงินในบัตร TP ของคุณ จำนวนเงินจะถูกแปลงเป็นยูโร ดอลลาร์ หรือฟรังก์สวิส. ตามนั้น จำนวนเงินที่เทียบเท่ากับ EUR24, USD24 หรือ CHF24 จะถูกโอนไปยังกระเป๋าเงิน on-chain ของคุณ. สินทรัพย์ในกระเป๋าเงิน on-chain ของคุณเท่ากับยอดคงเหลือของบัตร TP ของคุณ. ทุกครั้งที่คุณทำธุรกรรม ยอดคงเหลือ on-chain ของคุณจะถูกหักโดยอัตโนมัติเป็นจำนวนเงินที่สอดคล้องกันเพื่อให้แน่ใจว่าสอดคล้องกับเงินในบัตร TP ของคุณ.',
      question_9_1:
        'หากฉันต้องการโอน EUR24 หรือ USD24 ให้กับคนอื่น ยอดเงินในบัตรธนาคารของพวกเขาจะเพิ่มขึ้นหรือไม่? ฉันควรระวังอะไรบ้าง?',
      answer_9_1:
        'ในการโอน EUR24 หรือ USD24 ให้กับผู้อื่น ที่อยู่ของผู้รับต้องมี NFT บัญชีและต้องผ่านการลงทะเบียนธนาคารแล้ว. มิฉะนั้น การโอนของคุณจะล้มเหลว.',
      answer_9_2:
        'หากผู้รับได้ผ่านการลงทะเบียนธนาคารแล้ว การโอน EUR24 หรือ USD24 ไปยังบัญชีของพวกเขาเทียบเท่ากับการโอนเงินผ่านธนาคารให้กับพวกเขา. ยอดเงินในสินทรัพย์ของพวกเขาจะเพิ่มขึ้นตาม.',
      question_10_1:
        'ฉันสามารถเปลี่ยนกระเป๋าเงินที่เชื่อมโยงกับบัตร TP ของฉันได้หรือไม่? สินทรัพย์ของฉันจะสูญหายหรือไม่? ฉันควรทำอย่างไร?',
      answer_10_1:
        'ได้ คุณสามารถเปลี่ยนกระเป๋าเงินที่เชื่อมโยงกับบัตร TP ของคุณได้โดยไม่สูญเสียสินทรัพย์. ทำตามขั้นตอนต่อไปนี้:',
      answer_10_2:
        '- ก่อนอื่น คุณต้องโอน NFT บัตร TP ของคุณไปยังที่อยู่กระเป๋าเงินใหม่.',
      answer_10_3:
        '- หลังจากโอนบัตร TP แล้ว ให้โอน EUR24, USD24 และสินทรัพย์อื่น ๆ ของคุณไปยังที่อยู่ใหม่เดียวกัน.',
      answer_10_4:
        '- เมื่อการโอนเสร็จสิ้น บัตร TP ของคุณจะเชื่อมโยงกับกระเป๋าเงินใหม่และสินทรัพย์ทั้งหมดจะอยู่ภายใต้ที่อยู่ใหม่.',
      question_11_1: 'กระเป๋าเงินของฉันสามารถสร้าง NFT บัญชีได้กี่รายการ?',
      answer_11_1:
        'กระเป๋าเงินสามารถถือ NFT บัญชีได้เพียงหนึ่งรายการเท่านั้น. หากกระเป๋าเงินของคุณมี NFT บัญชีอยู่แล้ว คุณจะไม่สามารถสร้างอีกอันได้. นอกจากนี้ คุณไม่สามารถซื้อ NFT บัญชีเพิ่มเติมได้ผ่านการซื้อ.',
      question_12_1: 'ฉันควรทำอย่างไรหากบัตรธนาคารของฉันถูกระงับ?',
      answer_12_1:
        'หากบัญชีธนาคารของคุณแสดงว่าถูกระงับ โปรดติดต่อ Fiat24 เพื่อขอความช่วยเหลือในการตรวจสอบสาเหตุและขั้นตอนการจัดการต่อไป.',
      answer_12_2: 'ติดต่อฝ่ายบริการลูกค้า Fiat24: service@fiat24.com',
      question_13_1:
        'ฉันจะขอคืนเงินได้อย่างไร? การดำเนินการคืนเงินจะใช้เวลานานแค่ไหน?',
      answer_13_1:
        'หากคุณขอคืนเงินสำหรับการทำธุรกรรม เงินคืนจะถูกส่งกลับไปยังบัญชีธนาคารของคุณภายใน 3-5 วันทำการหลังจากผู้ขายเสร็จสิ้นกระบวนการคืนเงิน. โปรดอดทนรอในช่วงเวลานี้. หากคุณต้องการความช่วยเหลือ โปรดติดต่อฝ่ายบริการลูกค้า Fiat24: service@fiat24.com',
    },
  },
  VIP: {
    title: 'About VIPs',
    introduce_1:
      'User levels are determined by earned points: higher points lead to higher levels, resulting in lower deposit fees and higher referral rates.',
    introduce_2:
      'Points are accumulated through deposits, invitations.',
    introduce_3:
      'Your level is updated in real-time based on your total points over the past three months and reassessed daily at 00:00 UTC.',
    text_1: 'VIPs & Benefits：',
    text_2: 'Point',
    text_3: 'Fee',
    text_4: 'Referral',
    text_5: 'Extra Benefit for Premium：',
    text_6: '- Deposit fee reduced by an additional 0.1%',
    text_7: '- Referral rewards increased by an additional 10%',
  },
  REFPOINT: {
    title: 'Deposit to Earn Points',
    title_1:
      'You can earn points through deposits; the more you deposit, the more points you earn, with no limit.',
    desc_1:
      '- For every 100 USDC deposited, users earn 100 points, with a minimum unit of 1 point.',
    desc_2:
      '- Points take effect immediately and are valid for 3 months. Points older than 3 months will be automatically discarded.',
  },
};
